Autodesk.Revit.UI.SnappingServiceData.GetWorkPlane
Returns a copy of the current sketch plane

Autodesk.Revit.UI.SnappingServiceData.GetInPoint
Gets the point to snap near.
Returns:
The point to snap near
Since:
2017

Autodesk.Revit.UI.SnappingServiceData.GetLocalToPage(Autodesk.Revit.DB.XYZ)
Transforms local coordinates of a point to page coordinates.
Inpoint:
Input the point local coordinates
Returns:
Return the transformed coordinates
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.SnappingServiceData.AddPointSnaps(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ElementId)
Takes point snaps from the instance of ISnappingServer and passes them to Revit.
pointSnaps:
The points to add as snaps.
elemId:
Id of the element providing snap points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.SnappingServiceData.AddBoundedLineSnaps(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.ElementId)
Takes line snaps from the instance of ISnappingServer and passes them to Revit.
lineSnaps:
Lines are represented by two XYZs: start point, end point.
projectToWorkPlane:
Whether to project the lines to the work plane. For instance, if the line snaps represent
planes, we want to project them. If they represent cylinders, we do not.
elemId:
Id of the element providing snap points.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the array lineSnaps has an odd number of entries and is hence not a valid line snap
array, since lines are represented as an origin XYZ followed by a direction XYZ.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.SnappingServiceData.AddLineSnaps(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.ElementId)
Takes line snaps from the instance of ISnappingServer and passes them to Revit.
lineSnaps:
Lines are represented by two XYZs: first an origin, then a direction.
projectToWorkPlane:
Whether to project the lines to the work plane. For instance, if the line snaps represent
planes, we want to project them. If they represent cylinders, we do not. If we project
to the work plane, we also verify that the line is parallel to the work plane.
elemId:
Id of the element providing snap points.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the array lineSnaps has an odd number of entries and is hence not a valid line snap
array, since lines are represented as an origin XYZ followed by a direction XYZ.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.SnappingServiceData.GetViewRectangle
Returns the view rectangle in local coordinates.
Returns:
The view rectangle in local coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the View in which snapping is being done is not in a usable state (e.g. it is not
finished drawing).

Autodesk.Revit.UI.SnappingServiceData.GetPointSnappingRadius
The size of the sampling region for the nearest best point detection.
Returns:
The size of the sampling region for the nearest best point detection.

Autodesk.Revit.UI.SnappingServiceData.GetViewDirection
A unit vector from the eye to the point around which to detect features.
Returns:
A unit vector from the eye to the point around which to detect features.

Autodesk.Revit.UI.SnappingServiceData.GetScreenMMToModelMM
Returns the conversion factor between mm on the screen and mm in the model.
Returns:
The conversion factor between mm on the screen and mm in the model.

Autodesk.Revit.UI.SnappingServiceData.GetScreenMMToModelUnits
Returns the conversion factor between mm on the screen and model units.
Returns:
The conversion factor between mm on the screen and model units.

Autodesk.Revit.UI.SnappingServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.SnappingServiceData.InPoint
Gets the point to snap near.

Autodesk.Revit.UI.SnappingServiceData.DBView
Gets the View in which snapping is being done.

Autodesk.Revit.UI.SnappingServiceData.SnappingServers
Gets the snapping servers that are enabled.

Autodesk.Revit.UI.SnappingServiceData
This is a container for data and some functions which is passed from Revit to an instance of
ISnappingServer.
Remarks:
The snapping server reads the data and uses the functions to assist in finding snaps, then
sends the snaps back to SnappingServiceData using AddLineSnaps() and AddPointSnaps(), which
gives them back to Revit.